{
  "1": {
    "id": 1,
    "title": "Toyota Aqua Hybrid Battery Replacement Guide",
    "content": "Complete guide on replacing Toyota Aqua hybrid batteries. Learn about the 2012-2016 and 2020-2024 models, warranty options, and trade-in programs. Our expert technicians provide professional installation with 3-month warranty.\n\nThe Toyota Aqua hybrid system uses a sophisticated battery pack that requires specialized knowledge for replacement. Our certified technicians have extensive experience with both first and second-generation Aqua models.\n\nWe offer competitive pricing, quality assurance, and comprehensive warranty coverage. Contact us for a free diagnostic assessment of your hybrid battery system.",
    "excerpt": "Expert guide to Toyota Aqua hybrid battery replacement with warranty coverage",
    "imageUrl": "/images/battery.jpg",
    "category": "Hybrid Technology",
    "published": true,
    "createdAt": "2024-12-01T00:00:00.000Z"
  },
  "2": {
    "id": 2,
    "title": "Understanding Diesel Injector Maintenance",
    "content": "Diesel injectors are crucial for optimal engine performance. Learn about symptoms of faulty injectors, maintenance schedules, and our specialized repair services for Toyota D4D, Land Rover TDV6, and Mercedes Benz diesel engines.\n\nCommon symptoms include rough idling, black smoke, poor fuel economy, and starting difficulties. Regular maintenance can prevent costly repairs and extend injector life.\n\nOur advanced diagnostic equipment can pinpoint injector issues quickly and accurately. We use OEM-quality parts and provide comprehensive testing after repairs.",
    "excerpt": "Complete maintenance guide for diesel injectors across multiple vehicle brands",
    "imageUrl": "/images/injector.jpg",
    "category": "Diesel Systems",
    "published": true,
    "createdAt": "2024-11-28T00:00:00.000Z"
  },
  "3": {
    "id": 3,
    "title": "Honda GP5 Hybrid System Components",
    "content": "Understanding the Honda GP5 Fit hybrid system components and maintenance requirements. This comprehensive guide covers battery diagnostics, motor controllers, and system optimization.\n\nThe Honda GP5 features an innovative IMA (Integrated Motor Assist) system that requires specialized maintenance procedures. Learn about common issues and preventive care.\n\nOur technicians are trained in Honda hybrid systems and use genuine Honda diagnostic tools for accurate service and repairs.",
    "excerpt": "Comprehensive guide to Honda GP5 hybrid system maintenance and components",
    "imageUrl": "/images/battery2.jpg",
    "category": "Hybrid Technology",
    "published": true,
    "createdAt": "2024-11-25T00:00:00.000Z"
  }
}